app/controllers/categories_controller.rb

  def create
    @category = Category.new(params[:category])
    if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at", "parent_id") VALUES('Завтрак', '2010-05-03 17:14:00', '2010-05-03 17:14:00', NULL)

  def edit
    @category = Category.find(params[:id])
---
SELECT * FROM "categories" WHERE ("categories".parent_id = 1)

  def update
    @category = Category.find(params[:id])
    if @category.update_attributes(params[:category])
---
SELECT * FROM "categories" WHERE ("categories"."id" = 1)
UPDATE "categories" SET "updated_at" = '2010-05-03 17:15:21', "name" = 'Завтраки' WHERE "id" = 1

  def destroy
    @category = Category.find(params[:id])
    @category.destroy
---
SELECT * FROM "categories" WHERE ("categories"."id" = 12)
DELETE FROM "categories" WHERE "id" = 12