app/controllers/dishes_controller.rb

SELECT * FROM "dishes"
---
  def index
    @dishes = Dish.all

SELECT * FROM "dishes" WHERE ("dishes"."id" = 1)
---
  def show
    @dish = Dish.find(params[:id])

INSERT INTO "dishes" ("name", "price", "created_at", "available", "updated_at", "category_id", "desc") VALUES('Пина Колада', NULL, '2010-05-09 09:45:08', 'f', '2010-05-09 09:45:08', 14, 'Положите в шейкер колотый лед, налейте светлый ром, кокосовый ликер и ананасовый сок. Слегка потрясите для смешивания. Сцедите в большой стакан и украсьте коктейль вишней и дольками ананаса.')
---
  def create
    @dish = Dish.new(params[:dish])
    if @dish.save

SELECT * FROM "dishes" WHERE ("dishes"."id" = 1)
---
  def edit
    @dish = Dish.find(params[:id])

SELECT * FROM "dishes" WHERE ("dishes"."id" = 1)
UPDATE "dishes" SET "updated_at" = '2010-05-09 14:44:48', "desc" = 'В высокий бокал (хайболл), наполненный льдом, налить все компоненты, аккуратно перемешать и украсить долькой лайма.', "price" = 300.0 WHERE "id" = 4
---
  def update
    @dish = Dish.find(params[:id])
    if @dish.update_attributes(params[:dish])

SELECT * FROM "dishes" WHERE ("dishes"."id" = 4)
DELETE FROM "dishes" WHERE "id" = 4
---
  def destroy
    @dish = Dish.find(params[:id])
    @dish.destroy