app/controllers/ingredients_controller.rb

SELECT * FROM "ingredients"
---
  def index
    if params[:query]
      @ingredients = Ingredient.find(:all, :conditions => ['name LIKE ?', "%#{params[:query]}%"])


      suggestions = Array.new
      for ingr in @ingredients
        suggestions.push(ingr.name)
      end

       response.headers['Content-type'] = "text/plain; charset=utf-8"

      ret = {}
      ret["query"] = params[:query]
      ret["suggestions"] = suggestions


      render :text => ret.to_json

    else
      @ingredients = Ingredient.all

SELECT * FROM "ingredients" WHERE ("ingredients"."id" = 1)
---
  def show
    @ingredient = Ingredient.find(params[:id])

SELECT * FROM "ingredients" WHERE ("ingredients"."id" = 1)
---
  def edit
    @ingredient = Ingredient.find(params[:id])

SELECT * FROM "ingredients" WHERE ("ingredients"."id" = 1)
UPDATE "ingredients" SET "updated_at" = '2010-05-09 13:52:40', "name" = 'игристое вино 123' WHERE "id" = 1
---
  def update
    @ingredient = Ingredient.find(params[:id])
    if @ingredient.update_attributes(params[:ingredient])

SELECT * FROM "ingredients" WHERE ("ingredients"."id" = 4)
DELETE FROM "ingredients" WHERE "id" = 4
---
  def destroy
    @ingredient = Ingredient.find(params[:id])
    @ingredient.destroy